class LLMConfig:
    EMBEDDING_DIM = 1024  # Размер эмбеддингов Gigachat
    TOP_K = 5  # Кол-во ближайших соседей, возвращаемых FAISS
    SIMILARITY_DISTANCE = 0.87  # Делаем ограничение по схожести (для эталонов)
    SIMILARITY_DISTANCE_REF = 0.92  # Граница позволяющая лайкнуть или дизлайкнуть эталон
    MAX_BLOCK_CHARS = 500  # Ограничение количества символов для группировки сообщений
    CHUNK_SIZE = 1000  # Ограничение максимальной длинны одного чанка (фрагмента текста)
    CHUNK_OVERLAP = 15  # Кол-во символов для перекрытия на стыке фрагментов
    CHAT_FAISS_INDEX_PATH = "resources/index/"  # Папка для сохранения FAISS-индексов
    CHAT_TOP_K = 5  # Кол-во ближайших соседей, возвращаемых FAISS (для чатов)
    CHAT_MIN_SIM = 0.83  # # Делаем ограничение по схожести (для чатов)
